music_app/app/models/user.rb

    def reset_session_token! # resets session token of user to logout, also so that session token of past sessions is not the same
        self.session_token = generate_unique_session_token
        self.save!
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "[FILTERED]"], ["updated_at", "2023-10-03 19:33:34.233096"], ["id", 1]]